In [2]:
import numpy as np
import pandas as pd

data = {
    'Name' : ['John','Ana','Peter','Linda'],
    'Age' : [20,34,29,42],
    'City' : ['New York','Paris','Berlin','London'],
    'Salary' : [65000,70000,62000,85000]
}
df = pd.DataFrame(data)
print(df)

    Name  Age      City  Salary
0   John   20  New York   65000
1    Ana   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [3]:
df

    Name  Age      City  Salary
0   John   20  New York   65000
1    Ana   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [4]:
df[['City','Name']]

       City   Name
0  New York   John
1     Paris    Ana
2    Berlin  Peter
3    London  Linda

In [5]:
df['Designation'] = ['Doctor','Eng.','Doctor','Eng.']

In [6]:
df

    Name  Age      City  Salary Designation
0   John   20  New York   65000      Doctor
1    Ana   34     Paris   70000        Eng.
2  Peter   29    Berlin   62000      Doctor
3  Linda   42    London   85000        Eng.

In [ ]:
df.loc[[0,1]] # Location

   Name  Age      City  Salary Designation
0  John   20  New York   65000      Doctor
1   Ana   34     Paris   70000        Eng.

In [ ]:
df.iloc[[0,1]] # Index Location

   Name  Age      City  Salary Designation
0  John   20  New York   65000      Doctor
1   Ana   34     Paris   70000        Eng.

In [13]:
df.loc[[0,1]][['City','Salary']]

       City  Salary
0  New York   65000
1     Paris   70000

In [14]:
df[df['Salary'] > 70000]

    Name  Age    City  Salary Designation
3  Linda   42  London   85000        Eng.

In [16]:
df[(df['Age'] > 30) & (df['City'] =='Paris')]

  Name  Age   City  Salary Designation
1  Ana   34  Paris   70000        Eng.

In [19]:
# Misiing Data

import numpy as np
import pandas as pd

data2 = {

   'A' : [1,2,np.nan,4,5],
   'B' : [np.nan,2,3,4,5],
   'C' : [1,2,3,np.nan,np.nan],
   'D' : [1,np.nan,np.nan,np.nan,5]
     
     
 }
df2 = pd.DataFrame(data2)
print(df2)

     A    B    C    D
0  1.0  NaN  1.0  1.0
1  2.0  2.0  2.0  NaN
2  NaN  3.0  3.0  NaN
3  4.0  4.0  NaN  NaN
4  5.0  5.0  NaN  5.0

In [21]:
# Isna
df2.isna()

       A      B      C      D
0  False   True  False  False
1  False  False  False   True
2   True  False  False   True
3  False  False   True   True
4  False  False   True  False

In [22]:
df2.isna().sum()

A    1
B    1
C    2
D    3
dtype: int64

In [24]:
df2.isna().any()

A    True
B    True
C    True
D    True
dtype: bool

In [ ]:
df2.dropna() # Row function

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [ ]:
df2.dropna(thresh=3) # thress looks for non null values in rows

     A    B    C    D
0  1.0  NaN  1.0  1.0
1  2.0  2.0  2.0  NaN
4  5.0  5.0  NaN  5.0

In [27]:
# Filling the missing data
df2.fillna(0)

     A    B    C    D
0  1.0  0.0  1.0  1.0
1  2.0  2.0  2.0  0.0
2  0.0  3.0  3.0  0.0
3  4.0  4.0  0.0  0.0
4  5.0  5.0  0.0  5.0

In [28]:
values = {'A': 0,'B': 100, 'C': 300, 'D': 400}
df2.fillna(value=values)

     A      B      C      D
0  1.0  100.0    1.0    1.0
1  2.0    2.0    2.0  400.0
2  0.0    3.0    3.0  400.0
3  4.0    4.0  300.0  400.0
4  5.0    5.0  300.0    5.0

In [30]:
df2.fillna(df2.mean())

     A    B    C    D
0  1.0  3.5  1.0  1.0
1  2.0  2.0  2.0  3.0
2  3.0  3.0  3.0  3.0
3  4.0  4.0  2.0  3.0
4  5.0  5.0  2.0  5.0

In [32]:
import numpy as np
import pandas as pd
employees ={
    'employee_id': [1,2,3,4,5],
    'name': ['John','Ana','Peter','Linda','Bob'],
    'department': ['HR','IT','Finance','IT','HR']
}
salary = {
    'employee_id': [1,2,3,6,7],
    'salary': [60000,80000,65000,70000,90000],
    'bonus': [5000,10000,7000,8000,12000]
}

In [34]:
x = pd.DataFrame(employees)
y = pd.DataFrame(salary)

In [35]:
x

   employee_id   name department
0            1   John         HR
1            2    Ana         IT
2            3  Peter    Finance
3            4  Linda         IT
4            5    Bob         HR

In [36]:
y

   employee_id  salary  bonus
0            1   60000   5000
1            2   80000  10000
2            3   65000   7000
3            6   70000   8000
4            7   90000  12000

In [40]:
pd.merge(x,y,on = 'employee_id',how= 'outer')

   employee_id   name department   salary    bonus
0            1   John         HR  60000.0   5000.0
1            2    Ana         IT  80000.0  10000.0
2            3  Peter    Finance  65000.0   7000.0
3            4  Linda         IT      NaN      NaN
4            5    Bob         HR      NaN      NaN
5            6    NaN        NaN  70000.0   8000.0
6            7    NaN        NaN  90000.0  12000.0

In [41]:
pd.merge(x,y,on = 'employee_id',how= 'left')

   employee_id   name department   salary    bonus
0            1   John         HR  60000.0   5000.0
1            2    Ana         IT  80000.0  10000.0
2            3  Peter    Finance  65000.0   7000.0
3            4  Linda         IT      NaN      NaN
4            5    Bob         HR      NaN      NaN

In [ ]:
# Concatenation

In [42]:
# Grrouping By Aggregation

import numpy as np
import pandas as pd
data = {
    'Category' : ['A','B','A','B','A','B','A','B'],
    'Store' : ['S1','S1','S2','S2','S1','S2','S2','S1'],
    'Sales' : [100,200,150,250,120,100,200,300],
    'Quantity' : [10,15,12,18,8,20,15,25],
    'Date' : pd.date_range('2023-01-01',periods=8)
}

df4 = pd.DataFrame(data)

In [43]:
df4

  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
1        B    S1    200        15 2023-01-02
2        A    S2    150        12 2023-01-03
3        B    S2    250        18 2023-01-04
4        A    S1    120         8 2023-01-05
5        B    S2    100        20 2023-01-06
6        A    S2    200        15 2023-01-07
7        B    S1    300        25 2023-01-08

In [51]:
a = df4.groupby('Category')

In [52]:
print(a)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000019CA2DC3570>

In [53]:
for i,v in a:
    print(i)
    print(v)

A
  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
2        A    S2    150        12 2023-01-03
4        A    S1    120         8 2023-01-05
6        A    S2    200        15 2023-01-07
B
  Category Store  Sales  Quantity       Date
1        B    S1    200        15 2023-01-02
3        B    S2    250        18 2023-01-04
5        B    S2    100        20 2023-01-06
7        B    S1    300        25 2023-01-08

In [54]:
df4.groupby('Category')['Sales'].sum()

Category
A    570
B    850
Name: Sales, dtype: int64

In [55]:
b= df4.groupby('Store')

In [56]:
for i , v in b:
    print(i)
    print(v)

S1
  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
1        B    S1    200        15 2023-01-02
4        A    S1    120         8 2023-01-05
7        B    S1    300        25 2023-01-08
S2
  Category Store  Sales  Quantity       Date
2        A    S2    150        12 2023-01-03
3        B    S2    250        18 2023-01-04
5        B    S2    100        20 2023-01-06
6        A    S2    200        15 2023-01-07

In [57]:
df4.groupby('Store')['Sales'].sum()

Store
S1    720
S2    700
Name: Sales, dtype: int64

In [60]:
c = df4.groupby(['Category','Store'])['Sales'].sum()

In [61]:
c

Category  Store
A         S1       220
          S2       350
B         S1       500
          S2       350
Name: Sales, dtype: int64

In [ ]:
## Pivot Tables
import numpy as np